app/Http/Controllers/Auth/ProfileController.php

select * from `artisans` where `artisans`.`user_id` = 1 and `artisans`.`user_id` is not null limit 1
select * from `products` where `artisan_id` = 1
select * from `products` where `artisan_id` = 2
---
    public function index(User $user)
    {
        // lets use cache to store the user profile page for 10 minutes
        $cachedUser = Cache::remember('user-profile-'.$user->id, 60 * 10, function () use ($user) {

            return $user;
        });

        $cachedWilayas = Cache::remember('wilayas', 60 * 10, function () {
            return AlgerianCitiesFacade::getAllWilayas();
        });

        if ($user->isArtisan()) {
            $artisanProducts = Cache::remember('artisan-products-'.$user->id, 60 * 10, function () use ($user) {
                return Product::where('artisan_id', $user->id)->get();
            });

update `users` set `password` = '$2y$10$avMVjmTD9qVBtzcrZogS6eaKrhw1HIK0IgquDXH9GjZStVlRnaMI2', `users`.`updated_at` = '2023-12-02 13:57:31' where `id` = 1
---
    public function update(User $user, Request $request)
    {
        $data = $request->validate([
            'nom' => 'required|string|max:255',
            'prenom' => 'required|string|max:255',
            'email' => 'required|email|unique:users,email,'.$user->id,
            'num_telephone' => 'required|string',
            'adresse' => 'required|string|max:255',
            'wilaya' => 'required|string|max:255',
            'password' => 'nullable|string',
        ]);

        $user->update([
            'nom' => $data['nom'],
            'prenom' => $data['prenom'],
            'email' => $data['email'],
            'num_telephone' => $data['num_telephone'],
            'adresse' => $data['adresse'],
            'wilaya' => $data['wilaya'],
        ]);

        // Update artisan-specific fields
        if ($user->artisan) {
            $speceficData = $request->validate([
                'heure_ouverture' => 'required|string',
                'heure_fermeture' => 'required|string',
                'desc_entreprise' => 'required|string',
                'type_service' => 'required|string',
            ]);

            $user->artisan->update($speceficData);