app/Livewire/ArtisansPage.php

    public function render()
    {
        $wilayas = AlgerianCitiesFacade::getAllWilayas();

        return view('livewire.artisans-page', [
            'artisans' => Artisan::select('user_id', 'rating', 'type_service')
                ->filters($this->filters)
                ->orderBy('rating', 'desc')
                ->paginate(10),
            'wilayas' => $wilayas,
        ]);
---
select `user_id`, `rating`, `type_service` from `artisans` where exists (select * from `users` where `artisans`.`user_id` = `users`.`id` and `wilaya` = 'Tlemcen') order by `rating` desc limit 10 offset 0
select count(*) as aggregate from `artisans` where exists (select * from `users` where `artisans`.`user_id` = `users`.`id` and `wilaya` = 'Tlemcen')

    public function applyFilters()
    {
        $this->filters = [
            'search' => $this->search,
            'artisanWilaya' => $this->artisanWilaya,
            'artisanRating' => $this->artisanRating,
            'typeService' => $this->typeService,
        ];
---
select * from `artisans`