app/Livewire/CartComponent.php

select count(*) as aggregate from `carts` where `user_id` = 1
---
    public function updateCart()
    {
        $this->cartCount = Cart::where("user_id", auth()->user()->id)->count();

select count(*) as aggregate from `carts` where `user_id` = 2
---
    public function render()
    {
        if (Auth::check()) {
            $this->cartCount = Cart::where(
                "user_id",
                auth()->user()->id
            )->count();