app/Livewire/CommentComponent.php

select * from `reviews` where `reviews`.`product_id` = 1 and `reviews`.`product_id` is not null order by `created_at` desc
---
    public function render()
    {
        $this->comments = $this->product
            ->reviews()
            ->latest()
            ->get();