app/Livewire/ProductsPage.php

    public function render()
    {
        return view("livewire.products-page", [
            "products" => Product::select(
                "id",
                "nom",
                "prix",
                "categorie",
                "images"
            )
                ->filters($this->filters)
                ->orderBy("prix", $this->orderDirection)
                ->paginate(10),
        ]);
---
select `id`, `nom`, `prix`, `categorie`, `images` from `products` order by `prix` desc limit 10 offset 0
select count(*) as aggregate from `products`