app/Livewire/ProductsPage.php

select * from `products` order by `prix` desc limit 10 offset 0
---
    public function render()
    {
        return view('livewire.products-page', [
            'products' => Product::filters($this->filters)
                ->orderBy('prix', $this->orderDirection)
                ->paginate(10),
        ]);