app/Livewire/UserReviewComponent.php

select * from `user_reviews` where `user_id` = 2 order by `created_at` desc
---
    public function render()
    {
        $this->comments = UserReview::where("user_id", $this->user->id)
            ->latest()
            ->get();