app/Models/User.php

    public function getIsArtisanAttribute(): bool
    {
        return $this->artisan()->exists();
---
select * from `artisans` where `artisans`.`user_id` = 1 and `artisans`.`user_id` is not null limit 1